{
   "0-legal-notice":"Legal warning - Hey, thanks for using Remotive's API, we appreciate it! By using Remotive's API, you legally agree to mention Remotive as a source and provide a link back to Remotive's job listing URL with a direct link back to Remotive. Redirect isn't accepted, sorry! Also, please note that our logo(s) and our cool illustrations belong to Remotive and can't be reused without Remotive represent explicit, written permission. Please find out terms of services on https://remotive.io/api-documentation. Many thanks (Rodolphe & the Remotive team!)",
   "job-count":1707,
   "jobs":[
      {
         "id":515247,
         "title":"Supply Chain Coordinator",
         "company_name":"Rocketbook",
         "category":"All others",
         "tags":[
            
         ],
         "job_type":"full_time",
         "publication_date":"2021-03-25T09:45:38",
         "candidate_required_location":"USA Only",
         "salary":"",
         "description":"<p>Rocketbook is a high-performance team, revolutionizing the way millions of people use and digitize handwritten notes. In the past few years, we've become a disruptive force in the office supply industry by delivering a unique blend of digital and physical innovation. We're just getting started.</p>\n<p>Do you enjoy logistics and supply chain management? Do you want to work with an innovative team that invents cutting edge office and school products?</p>\n<p>Awesome! We're looking for a talented supply chain coordinator to join the Rocketbook Crew! </p>\n<p> </p>\n<p><strong>Who YOU are:</strong></p>\n<ul>\n<li>Highly organized and capable of tracking multiple moving pieces</li>\n<li>Proficient with Excel to generate reports, pivot tables, charts, and trackers</li>\n<li>Tech savvy enough to manage multiple SaaS platforms</li>\n<li>Always looking for ways to improve efficiency, regardless of the task</li>\n<li>Hard-working, team player, and a pleasure to be around</li>\n<li>2-3 years of experience in a supply chain-oriented role</li>\n</ul>\n<p> </p>\n<p><strong>What you'll DO:</strong></p>\n<ul>\n<li>Issue purchase orders to our suppliers based on analysis of sales forecast</li>\n<li>Track timelines and the arrival of all raw materials and accessories</li>\n<li>Collaborate with Product team to finalize new products and land them in our warehouses</li>\n<li>Work directly with our manufacturing vendors to maintain production schedule while ensuring quality</li>\n<li>Identify and implement system improvements such as PO generation and reconciliation</li>\n</ul>\n<p><strong>Bonus Points:</strong> Experience with writing and/or running Ruby or Python scripts to automate repetitive tasks</p>\n<p> </p>\n<p><strong>What you WON'T do:</strong></p>\n<ul>\n<li>Wait for creative ideas to be handed to you, or initiative to be requested of you</li>\n<li>Work within the strict boundaries of your job description or department charter</li>\n<li>Be uncourteous to your teammates, not help them succeed, or hold back opportunities to help the business grow</li>\n<li>Remain stagnant as a professional and individual</li>\n<li>Keep your curiosity, opinions, quirks, and terrible jokes to yourself</li>\n</ul>\n<p> </p>\n<p><strong>No need to apply if:</strong></p>\n<ul>\n<li>You aren't an entrepreneurial self-starter.</li>\n<li>You don't have ideas and you wait for someone else to execute.</li>\n<li>You can't strategically plan OR you are highly uncomfortable when the plan changes.</li>\n<li>You aren't curious and don't want to grow individually.</li>\n<li>You can't give and receive LOTS of constructive feedback.</li>\n<li>You aren't fun to be around.</li>\n<li>You hate geeky sci-fi movies and cheesy space puns.</li>\n</ul>\n<p><strong>Pro Tip: </strong>Top candidates will be self-starters who are able to execute quickly on the day-to-day tasks at hand while always looking for ways to improve on processes in the future.</p>\n<p> </p>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Health, Dental and Vision Insurance</li>\n<li>Flexible and unlimited vacation policy</li>\n<li>401(K) plan with match</li>\n<li>Remote-work friendly</li>\n</ul>\n<p><em>Rocketbook is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em><em><br></em></p>\n"
      },
      {
         "id":543382,
         "url":"https://remotive.io/remote-jobs/writing/copywriter-543382",
         "title":"Copywriter",
         "company_name":"Postclick",
         "category":"Writing",
         "tags":[
            
         ],
         "job_type":"full_time",
         "publication_date":"2021-03-25T09:45:36",
         "candidate_required_location":"USA Only",
         "description":"<div class=\"h3\">Who is Postclick?</div>\n<p>As the global leader in digital advertising conversion, we are on a mission to automate advertising conversion by dynamically delivering relevant post-click experiences at a scale previously thought impossible. We offer two impactful products to improve your advertising conversion - Instapage for SMB’s and the new Postclick Advertising Cloud platform for Enterprises.</p>\n<p>Our diverse team is made up of innovators who seek high and push hard! We are a people-first tech start-up based in the SOMA area of San Francisco with offices in Austin, Texas, Timişoara, Romania, Warsaw, Poland, Bialystok, Poland, and some fully remote employees!</p>\n<p>As a Postclicker, we treat everyone with respect. We love our jobs, even on Mondays. We strive to have buckets of fun!</p>\n<p>Advertisers who focus only on getting more clicks are leaving their customers at the finish line. They need to finish strong with relevant landing page experiences that drive conversions. But most companies are not equipped to build these experiences at scale, so their conversion rate suffers. Postclick is changing that. Postclick helps digital marketers maximize their advertising conversions and return on ad spend by delivering hyper-relevant post-click experiences at a scale previously thought impossible.</p>\n<p>Delivered as a tech-enabled service, Postclick combines unparalleled conversion expertise, which comes from creating over 2 million post-click experiences for 10,000 brands, with the world's first Post-Click Automation platform, which is powered by machine learning, data science, and automation! Click on this link to learn more about<a class=\"external\" href=\"https://youtu.be/G0wUNOAILCU\" rel=\"nofollow\"> what we believe</a>!</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">The Job</div>\n<p>We are seeking a digital-first copywriter who has a passion for storytelling, with an eye for detail and a blend of creative advertising and UX/short-form writing as well as video storyboarding and script-writing skills. In this role, you will be responsible for the end-to-end writing process, from discovery through to publishing, writing headlines, CTAs, and other copy for Postclick integrated advertising, including our website, digital ads, events, sales collateral, interactive and explainer videos and more.</p>\n<p>Reporting to the Sr. Director of Corporate Marketing, this copywriter is one who thrives on making the complicated simple by skillfully taking complex material and communicating the core message in a few winning words. You have extensive experience writing web copy that motivates action by communicating the right message at the right moment in the user journey. You are an accomplished storyteller who knows how to translate customer needs, pain points, preferences, and ambitions into engaging experiences, and above all, you consistently deliver high-quality content.</p>\n<p>Our ideal candidate is a creative self-starter who possesses strong writing and organizational skills and has experience producing polished marketing marketing materials that sing. Those interested in this role must enjoy the blend of a fast pace and ambition within a fast-paced start-up culture, and above all else, a love of marketing should drive one’s daily work in this role.</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">A day in the life…</div>\n<ul>\n<li>Collaborate with cross functional partners to understand quarterly business goals, strategies, and consumer insights to inform the development of strategic writing across owned and earned channels and events.</li>\n<li>Write clear, concise, compelling copy that integrates product messaging, brand voice, and digital best practices to support overall business goals across web, digital advertising, video and interactive storyboards and scripts and more.</li>\n<li>Push Postclick forward with fresh, distinctive headlines and simple, human, engaging copy.</li>\n<li>Explore bold ideas and creative approaches to telling meaningful stories that connect with our customers.</li>\n<li>Develop knowledge of Posctlick and Instapage products, solutions, and related technologies, and distill technical concepts into meaningful customer benefits.</li>\n<li>Contribute creative ideas for new types of content, experience enhancements, and editorial opportunities.</li>\n<li>Drive editorial excellence and uphold standards and best practices to maintain consistent quality, voice, and style.</li>\n<li>Work closely with cross-functional groups to deliver strategic, data-driven, high-performing copy that is on-message and optimized for the web.</li>\n<li>Build strong relationships with partners and stakeholders, including strategy, SEO, brand, product marketing, research, analytics, and campaigns.</li>\n<li>Manage the content development process for assigned areas to execute on multiple projects and priorities simultaneously and ensure timely delivery of work under tight deadlines and rapidly changing parameters.</li>\n<li>Write in U.S. English for a global audience, optimizing copy for wide-scale translation across multiple languages.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>5+ years of experience writing clear, concise advertising and marketing copy for websites, digital products and advertising (preferably for both consumer brands and B2B technology companies)</li>\n<li>Expert at simplifying complex narratives into concise, compelling short-form web copy and headlines that grab attention and articulate complex ideas effectively</li>\n<li>Digital-first style and a user-centric, strategy-based approach to writing that cuts through the jargon and fluff to bring the essential narrative into focus</li>\n<li>Understanding of all aspects of content creation, including digital marketing, SEO, web design, strategy, and UX writing</li>\n<li>Strong portfolio demonstrating relevant, inspired writing samples and an effective content development process</li>\n<li>Must be a strong collaborator, solutions-orientated, effective communicator – both verbal &amp; written</li>\n<li>Entrepreneurial, self-starter and resourceful—someone who will thrive in a highly dynamic, fast-paced environment</li>\n<li>Possesses a genuine love of marketing and brand storytelling, agency experience preferred</li>\n<li>Exceptional ability to prioritize and manage projects within tight deadlines. Flexible and able to bob</li>\n<li>Strong writing talent (messaging, brand guidelines copy, brand communications) and presentation skills</li>\n<li>Ability to work in a fast-paced environment while being scrappy</li>\n<li>Analytical capabilities - must be able to look at data and interpret</li>\n<li>Highly collaborative with team members and other departments</li>\n</ul>\n<p><strong>We would love to hear from you if this sounds like you…</strong></p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Next Steps!</div>\n<p>If this sounds like you, then we can’t wait to meet you! Please send us your resume or detailed Linkedin profile and tell us a little about yourself with a cover letter that showcases some of the wondrous things you can do and why you want to work with us!</p>\n<p>There's one more significant thing. We are an equal opportunity employer that searches for outstanding people of diverse backgrounds, experiences, abilities, and perspectives. We take care of each other to build an inclusive work environment where we love to come to work every day, even Mondays! We'd be happy to provide reasonable accommodations to help you apply -<a class=\"external\" href=\"https://postclick.com/careers/#pc-workable\" rel=\"nofollow\"> Postclick Careers - Join Our Team</a>.</p>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<p><strong>Some of our amazing benefits include...</strong></p>\n<ul>\n<li>PTO = 15 Paid Vacation Days per Year, Paid holidays determined by Country location, Paid Sick Leave, and 12 Paid “Mental Health Days”</li>\n<li>Mental Health &amp; Wellness Program</li>\n<li>Generous monthly WFH Stipend plus an office set up allowance</li>\n<li>Flexible work hours.</li>\n<li>Full health benefits (medical, dental, vision)</li>\n<li>401(K)</li>\n<li>Top-of-the-line technology.</li>\n<li>Professional growth/continuing education (conferences, workshops, certifications, etc.)</li>\n<li>Hybrid office/WFH environment made up of some remote workers who will stay 100% remote post COVID and non-remote employees who will go back to the office two-three days a week once it’s safe.</li>\n<li>Globally Unified company.</li>\n<li>Ranked #16 tech company in SF for customer satisfaction and employee happiness</li>\n<li>Additional benefits are coming in 2021!</li>\n</ul>\n<p><em>Under the San Francisco Fair Chance Ordinance, we will consider employment-qualified applicants with arrest and conviction records.</em></p>\n<p> </p>\n"
      },
      {
         "id":515938,
         "url":"https://remotive.io/remote-jobs/qa/qa-engineer-515938",
         "title":"QA Engineer",
         "company_name":"Zego",
         "category":"QA",
         "tags":[
            
         ],
         "job_type":"full_time",
         "publication_date":"2021-03-25T09:45:34",
         "candidate_required_location":"UK Only",
         "salary":"140,000-150,000 per year",
         "description":"<div class=\"h3\">QA Engineer (London or UK Based Remote)</div>\n<p>We are Zego, a global insurtech scale-up providing cover that creates possibilities. In an ever-changing world, insurance is struggling to keep up. Through the power of emerging technologies, we are creating fairer products designed for the 21st century.</p>\n<p>In 2019, we closed our series B funding round, raising $42M from top-tier investors that will fuel our growth into new territories and the expansion of our product portfolio. We were also listed in the Fintech 50 and placed number 7 in the Startups 100. More recently, we were accepted into the Tech Nation Future 50 2020 cohort and won medium-sized Tech Company of the Year 2020 - solidifying our place as one of the UK’s most exciting and influential tech companies.</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Purpose of the Role:</div>\n<p>We are looking for a QA Engineer to help us scale our company-wide testing strategy.</p>\n<p>It is an exciting time to join, you will partner with world class engineers, designers and product managers to help make Zego the best loved insurance startup in the world.</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What you'll be working on:</div>\n<ul>\n<li>Scale testing to systematically improve the quality of our products and the experience of our customers</li>\n<li>Pair with product engineers to share testing expertise, develop user stories and build test suites</li>\n<li>Collaborate with engineers and testers to help solve issues and unblock quality issues</li>\n<li>Participate in product planning ceremonies and apply agile testing techniques</li>\n<li>Design, build and maintain test automation frameworks</li>\n<li>Integrate test plans with CI/CD pipelines</li>\n<li>Work on functional and non-functional automated testing: Regression/UI, Unit, Contract, Integration, Performance, Load</li>\n<li>Get hands-on with testing multiple products, including web, iOS and Android</li>\n</ul>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What you'll need to be successful in the role:</div>\n<p>We are looking for someone with a keen eye for detail and a drive to find defects, with an inquisitive mindset and the passion to improve quality. You should be comfortable working closely with the product, design and engineering teams. You are able to communicate effectively, influence and share knowledge within cross-functional squads in order to deliver high quality platforms in an agile environment.</p>\n<p>We are looking for someone who is a problem solver, someone who is passionate about technology and has the motivation to keep learning. You should be comfortable working in a fast-paced environment and have the ability to quickly adapt to change.</p>\n<p>You enjoy positively questioning the way things are done and want to join a company that is focused on constantly improving. You enjoy sharing ideas about how technologies and tools can be used to create elegant solutions. You can find the right balance of speed and accuracy when prioritising and take responsibility for ensuring a frictionless customer experience.</p>\n<div class=\"h3\"> </div>\n<div class=\"h3\">What's it like to work at Zego?</div>\n<p>We look for people who have expertise, enthusiasm and who are motivated by change. There’s plenty of room to learn and grow, as part of our ongoing training programmes or directly from other experts. You’ll work alongside a talented group of people who respect each other's differences and seek to understand fresh perspectives.</p>\n<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, or disability status.</p>\n"
      }
   ]
}
